app/controllers/rates_controller.rb

SELECT "rates".* FROM "rates" WHERE "rates"."rate_id" = 'g1'
---
  def index

    #@rates = Rate.all
    @rates = Rate.find_all_by_rate_id("a")

SELECT "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @rate = Rate.find(params[:id])

SELECT "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @rate = Rate.find(params[:id])

SELECT "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @rate = Rate.find(params[:id])