app/controllers/reports_controller.rb

  def index
    @reports = Group.all
---
SELECT "groups".* FROM "groups"