app/controllers/sessions_controller.rb

  def create
    user = User.find_by_u_id params[:account]
---
SELECT "users".* FROM "users" WHERE "users"."u_id" = '' LIMIT 1